app/views/articles/edit.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."section_title_id" = 1 LIMIT 1
SELECT "sub_section_titles".* FROM "sub_section_titles" WHERE "sub_section_titles"."section_title_id" = 10
---
	<h3>
		<% section = Section.find_by_section_title_id(title) %>

SELECT "section_titles".* FROM "section_titles" WHERE "section_titles"."article_id" = 6
SELECT "sub_sections".* FROM "sub_sections" WHERE "sub_sections"."sub_section_title_id" = 1 LIMIT 1
---

	<% title.sub_section_titles.each do |sub_title| %>