app/views/articles/show.html.erb

<% @section_titles.each do |section_title| %>
	<% section = Section.find_by_section_title_id(section_title) %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."section_title_id" = 10 LIMIT 1
SELECT "sub_section_titles".* FROM "sub_section_titles" WHERE "sub_section_titles"."section_title_id" = 10

	<!-- Sub_Sections -->
	<% section_title.sub_section_titles.each do |sub_title| %>
---
SELECT "section_titles".* FROM "section_titles" WHERE "section_titles"."article_id" = 11
SELECT "sub_sections".* FROM "sub_sections" WHERE "sub_sections"."sub_section_title_id" = 1 LIMIT 1

	<!-- Source Information -->
	<%= SourceType.find(source.type_id).name %>
---
SELECT "source_types".* FROM "source_types" WHERE "source_types"."id" = ? LIMIT 1  [["id", 4]]