app/controllers/articles_controller.rb

	def create
		@article = Article.create
		titles = params[:titles][:list].split(',')

		titles.each do |title|
			@article.article_titles.create(:title => title)
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 10 Feb 2013 22:53:46 UTC +00:00], ["updated_at", Sun, 10 Feb 2013 22:53:46 UTC +00:00]]
INSERT INTO "article_titles" ("article_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 6], ["created_at", Sun, 10 Feb 2013 22:53:46 UTC +00:00], ["title", "Pork"], ["updated_at", Sun, 10 Feb 2013 22:53:46 UTC +00:00]]

	def show
		@article = Article.find(params[:id])
		@title = stringify_titles(@article.article_titles)
		@section_titles = @article.section_titles
		@first_section = @section_titles.first
		@sub_section_titles = @first_section.sub_section_titles

		@sources = @article.sources.limit(3)

		@comment = @article.comments.new
		@comments = @article.comments.limit(3)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "sections".* FROM "sections" WHERE "sections"."section_title_id" = 10 LIMIT 1
SELECT "sub_section_titles".* FROM "sub_section_titles" WHERE "sub_section_titles"."section_title_id" = 10
SELECT "article_titles".* FROM "article_titles" WHERE "article_titles"."article_id" = 11
SELECT "sources".* FROM "sources" WHERE "sources"."article_id" = 9
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 9

	def destroy
		Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]

	def find_articles_from_titles(titles)
		articles = []
		titles.each do |title|
			article  = title.article
			if (articles & [article]).empty?
				articles << article
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 10 Feb 2013 22:49:59 UTC +00:00], ["updated_at", Sun, 10 Feb 2013 22:49:59 UTC +00:00]]