app/controllers/article_titles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "9"]]
---
	def edit
		@article = Article.find(params[:article_id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "24"]]
INSERT INTO "article_titles" ("article_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 24], ["created_at", Thu, 21 Feb 2013 20:28:59 UTC +00:00], ["title", "Blue Corn"], ["updated_at", Thu, 21 Feb 2013 20:28:59 UTC +00:00]]
---
	def update
		@article = Article.find(params[:article_id])
		@title = @article.article_titles.create(params[:article_title])

SELECT "article_titles".* FROM "article_titles" WHERE "article_titles"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "article_titles" WHERE "article_titles"."id" = ?  [["id", 5]]
---
	def destroy
		title = ArticleTitle.find(params[:article_title_id])
		title.destroy