app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "comments" ("article_id", "created_at", "rank", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["article_id", 9], ["created_at", Thu, 21 Feb 2013 16:26:04 UTC +00:00], ["rank", nil], ["text", "I love fish!"], ["updated_at", Thu, 21 Feb 2013 16:26:04 UTC +00:00], ["user_id", nil]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(params[:comment])
    session[:user] ? @comment.user_id = session[:user] : @comment.user_id = session[:admin]

    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
---
  def destroy
  	Comment.find(params[:id]).destroy