app/controllers/sections_controller.rb

	def create
		@article = Article.find(params[:article_id])
		title = @article.section_titles.create(:title => params[:model][:title])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "section_titles" ("article_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 6], ["created_at", Sun, 10 Feb 2013 23:27:55 UTC +00:00], ["title", "Tits"], ["updated_at", Sun, 10 Feb 2013 23:27:55 UTC +00:00]]
INSERT INTO "sections" ("created_at", "section_title_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 10 Feb 2013 23:31:03 UTC +00:00], ["section_title_id", 4], ["text", "hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh"], ["updated_at", Sun, 10 Feb 2013 23:31:03 UTC +00:00]]

	def edit
		@section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "4"]]

	def update
		@section = Section.find(params[:id])
		@section_title = @section.section_title

		@section.text = params[:model][:text]
		@section_title.title = params[:model][:title]

		if @section.save && @section_title.save
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "sections" SET "text" = 'Edit TExt', "updated_at" = '2013-02-19 18:33:30.247154' WHERE "sections"."id" = 4

	def destroy
		section = Section.find(params[:id])
		section_title = section.section_title

		section.destroy
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "section_titles" WHERE "section_titles"."id" = ?  [["id", 7]]
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 4]]