app/controllers/sections_controller.rb

	def new
		@article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "6"]]