app/controllers/sources_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "source_types".* FROM "source_types"
---
	def new
		@article = Article.find(params[:article_id])
		@source = @article.sources.new
		@types = SourceType.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "sources" ("article_id", "created_at", "link", "notes", "source", "title", "type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@article = Article.find(params[:article_id])
		@source = @article.sources.new(params[:source])

		if @source.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "source_types".* FROM "source_types"
---
	def edit
		@article = Article.find(params[:article_id])
		@source = Source.find(params[:id])
		@types = SourceType.all

SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sources" SET "link" = 'google.com', "updated_at" = '2013-02-22 05:31:13.108501' WHERE "sources"."id" = 1
---
	def update
		Source.find(params[:id]).update_attributes(params[:source])