app/controllers/sub_sections_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "sub_section_titles" ("created_at", "section_title_id", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Feb 2013 18:51:55 UTC +00:00], ["section_title_id", 10], ["title", "TEst sub"], ["updated_at", Tue, 19 Feb 2013 18:51:55 UTC +00:00]]
INSERT INTO "sub_sections" ("created_at", "sub_section_title_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Feb 2013 18:54:41 UTC +00:00], ["sub_section_title_id", 3], ["text", "Test sub_text"], ["updated_at", Tue, 19 Feb 2013 18:54:41 UTC +00:00]]
---
	def create
		section = Section.find(params[:section_id])
		section_title = section.section_title

		sub_section_title = section_title.sub_section_titles.create(:title => params[:model][:title])

SELECT "sub_sections".* FROM "sub_sections" WHERE "sub_sections"."id" = ? LIMIT 1  [["id", "9"]]
---
	def edit
		@sub_section = SubSection.find(params[:id])

SELECT "sub_sections".* FROM "sub_sections" WHERE "sub_sections"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "sub_sections" SET "text" = 'Why you eat me? Meow', "updated_at" = '2013-02-22 04:54:29.329201' WHERE "sub_sections"."id" = 6
---
	def update
		sub_section = SubSection.find(params[:id])
		sub_title = sub_section.sub_section_title

		sub_title.update_attributes(:title => params[:model][:title])

SELECT "sub_sections".* FROM "sub_sections" WHERE "sub_sections"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "sub_section_titles" WHERE "sub_section_titles"."id" = ?  [["id", 11]]
DELETE FROM "sub_sections" WHERE "sub_sections"."id" = ?  [["id", 8]]
---
	def destroy
		sub = SubSection.find(params[:id])
		title = sub.sub_section_title
		title.destroy