app/controllers/users_controller.rb

	def create
	  @user = User.new
	  @user.email = params[:user][:email]
	  @user.name = params[:user][:name]
	  @user.password = params[:user][:password]
	  @user.password_confirmation = params[:user][:password_confirmation]
	  if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)